yuanwil1y/esp32c6-Pwnagotchi/sdkconfig.defaults
# Phase 0 baseline derived from Waveshare 08_FactoryProgram.
CONFIG_IDF_TARGET="esp32c6"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_FREERTOS_HZ=1000

# Phase 3C: board bring-up, SD self-test, and UART logger-console setup run
# during app_main. The 3584-byte default overflowed on the C6 during this path.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Phase 1A: the Wi-Fi driver pushes the app past the default 1 MB factory
# slot; use a custom table with a 4 MB app partition (8 MB flash).
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Waveshare's SH8601/LVGL path uses RGB565 byte swap.
CONFIG_LV_COLOR_16_SWAP=y
CONFIG_LV_MEM_CUSTOM=y
CONFIG_LV_MEMCPY_MEMSET_STD=y
CONFIG_LV_ATTRIBUTE_FAST_MEM_USE_IRAM=y

# Phase 0 SD test file /sd_card/phase0_test.txt is not an 8.3 name; FATFS
# long filename support is required to create it (factory demo only used
# test.txt and shipped with LFN disabled).
CONFIG_FATFS_LFN_HEAP=y
